# RebarShapeConstraintSegmentLength Class

---
A constraint that controls the length of a segment.
SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintSegmentLength
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RebarShapeConstraintSegmentLength : RebarShapeConstraint

    Public Class RebarShapeConstraintSegmentLength
    	Inherits RebarShapeConstraint

    public ref class RebarShapeConstraintSegmentLength : public RebarShapeConstraint

    type RebarShapeConstraintSegmentLength =
        class
            inherit RebarShapeConstraint
        end
The RebarShapeConstraintSegmentLength type exposes the following members.
| Name| Description
---|---|---
| RebarShapeConstraintSegmentLength|  Create a segment length constraint.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from RebarShapeConstraint)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetParamId|  Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint)
| GetSegmentEndReferenceType|  Choice of two possibilities for the start and end references of the length constraint.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
The constraint has two references, indexed by 0 and 1, that do not have to correspond to the start and end of the segment.
#### Reference
Autodesk.Revit.DB.Structure Namespace